renesas/rx-driver-package/source/r_sdhi_rx/r_sdhi_rx_vx.xx/r_sdhi_rx/src/targets/rx72n/r_sdhi_dev.c
#if (SDHI_CFG_CH0_INCLUDED == 1)
    if (SDHI_CH0 == channel)
    {
        if (SDHI_CFG_CH0_CD_ACTIVE)
        {
            ret = SDHI_SUCCESS;
        }
    }
#endif  /* #if (SDHI_CFG_CH0_INCLUDED == 1) */

    return ret;
} /* End of function R_SDHI_CDLayout() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_WPLayout
 *****************************************************************************************************************/ /**
 * @brief This function checks whether the SDHI_WP (SD write protect) pin is used.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @retval    SDHI_SUCCESS WP pin used.
 * @retval    SDHI_ERR     WP pin not used.
 * @details   Checks whether the WP pin is used.
 * @note      None
 */
sdhi_status_t R_SDHI_WPLayout(uint32_t channel)
{
    sdhi_status_t ret = SDHI_ERR;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

#if (SDHI_CFG_CH0_INCLUDED == 1)
    if (SDHI_CH0 == channel)
    {
        if (SDHI_CFG_CH0_WP_ACTIVE)
        {
            ret = SDHI_SUCCESS;
        }
    }
#endif  /* #if (SDHI_CFG_CH0_INCLUDED == 1) */

    return ret;
} /* End of function R_SDHI_WPLayout() */

/**********************************************************************************************************************
* Outline      : Card Access Option Register Init
* Function Name: r_sdhi_dev_sdopt_init
* Description  : Card Access Option Register Init.
* Arguments    : void
* Return Value : uint32_t
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
uint32_t r_sdhi_dev_sdopt_init(void)
{
    return ((SDHI_SDOPT_INIT | SDHI_CFG_SDOPT_TOP) | SDHI_CFG_SDOPT_CTOP);
} /* End of function r_sdhi_dev_sdopt_init() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_GetSpeedType
 *****************************************************************************************************************/ /**
 * @brief This function gets information on the speed modes supported by the target microcontroller.
 * @param[in] channel
 *             Channel number : SDHI channel number to be used (starting from 0)
 * @retval    SDHI_SUCCESS Compatible with default-speed and high-speed modes
 * @retval    SDHI_ERR     Compatible with default-speed mode
 * @details   Gets information on the speed modes supported by the target microcontroller.
 * @note      None.
 */
sdhi_status_t R_SDHI_GetSpeedType(uint32_t channel)
{
    sdhi_status_t ret = SDHI_ERR;

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if ((uint32_t)((sizeof(g_sdhi_ip_base)) / sizeof(uint32_t)) <= channel)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return SDHI_ERR;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

#if (SDHI_CFG_CH0_INCLUDED == 1)
    if (SDHI_CH0 == channel)
    {
        ret = SDHI_SUCCESS;
    }
#endif  /* #if (SDHI_CFG_CH0_INCLUDED == 1) */

    return ret;
} /* End of function R_SDHI_GetSpeedType() */

/**********************************************************************************************************************
* Outline      : SDHI CLKSEL BIT check
* Function Name: r_sdhi_check_clksel
* Description  : Check SDHI CLKSEL BIT.
* Arguments    : uint32_t           channel              ;   SDHI Channel No.
* Return Value : SDHI_SUCCESS                            ;   CLKSEL BIT: PCLK division by 1 setting permitted
*              : SDHI_ERR                                ;   CLKSEL BIT: PCLK division by 1 setting prohibited
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdhi_status_t r_sdhi_check_clksel(uint32_t channel)
{
    sdhi_status_t ret = SDHI_ERR;

#if (SDHI_CFG_CH0_INCLUDED == 1)
    if (SDHI_CH0 == channel)
    {
        ret = SDHI_SUCCESS;
    }
#endif  /* #if (SDHI_CFG_CH0_INCLUDED == 1) */

    return ret;
} /* End of function r_sdhi_check_clksel() */

/**********************************************************************************************************************
 * Function Name: R_SDHI_IntHandler0
 *****************************************************************************************************************/ /**
 * @brief This function is the interrupt handler.
 * @param[in] *vect
 *             vector table
 * @details   This is the interrupt handler of the SDHI FIT module.\n 
 *            It is incorporated into the system as a processing routine for interrupt sources supported by the SDHI.\n
 *            When a callback function for the card access interrupt (CACI) and card detect interrupt (CDETI), 
 *            and a callback function for the SDIO access interrupt (SDACI) have been registered, 
 *            the appropriate callback function is called by this function.
 * @note      Before running this function, initialization processing by the R_SDHI_Open() function is required.
 */
void R_SDHI_IntHandler0(void * vect)
{
    sdhi_sdhndl_t   * p_hndl = 0;
    uint32_t          int_isr = 0;
    uint32_t          channel = 0;
    uint32_t          sdsts1 = 0;
    uint32_t          sdsts2 = 0;
    uint32_t          sdiosts = 0;

    channel = 0;
    p_hndl = SDHI_GET_HNDL(channel);

#if (SDHI_CFG_PARAM_CHECKING_ENABLE == 1)
    if (0 == p_hndl)
    {
        SDHI_LOG_FUNC(SDHI_DEBUG_ERR_ID, (uint32_t)SDHI_DEV, __LINE__);
        return;
    }
#endif /* SDHI_CFG_PARAM_CHECKING_ENABLE */

    int_isr = ICU.GRPBL1.LONG;

